InformationRegisters/СостоянияВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВакансий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияВакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияВакансии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Вакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Вакансии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаПодборПерсонала</xr:Item>
				<xr:Item>Catalog.ПрофилиДолжностей</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредполагаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаЗакрытия</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПодборПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется для единообразия с заявкой в форме «Согласование вакансий»</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетПрофилюДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОткрытияВакансий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыРаботыСКандидатами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапРаботы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнструментОценкиХарактеристикПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОценкиХарактеристик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОценкиХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СостоянияВакансий/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДатыПоСостояниям(Замещение);
	
	СохранитьПрежнееСостояние(Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПовторСостояния(Замещение);
	
	ИзменитьСостояниеСогласования(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПовторСостояния(Замещение)
	
	// Не разрешаем установить состояние, если вакансия на дату установки уже находится в этом состоянии
	Вакансии = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "Вакансия", Истина);
	Если Вакансии = Неопределено Или Вакансии.Количество() = 0 Тогда
		Возврат; // Не используем проверку в режиме записи набора целиком.
	КонецЕсли;
	
	// Проверка выполняется, фактически разрешая записать набор, 
	// и затем проверяет консистентность получившегося состояния в ИБ на предмет повторяющихся состояний.
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВакансий.Вакансия КАК Вакансия,
		|	СостоянияВакансий.Состояние КАК Состояние,
		|	СостоянияВакансий.Период КАК Период
		|ИЗ
		|	РегистрСведений.СостоянияВакансий КАК СостоянияВакансий
		|ГДЕ
		|	СостоянияВакансий.Вакансия В (&Вакансии)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостоянияВакансий.Период";

	УстановитьПривилегированныйРежим(Истина);
	СостоянияВакансий = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Для Каждого Вакансия Из Вакансии Цикл
		Состояния = СостоянияВакансий.Скопировать(Новый Структура("Вакансия", Вакансия));
		РегистрыСведений.СостоянияВакансий.ПроверитьСостояния(Состояния, Вакансия);
	КонецЦикла;
	

КонецПроцедуры

Процедура СохранитьПрежнееСостояние(Замещение)
	
	Вакансии = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "Вакансия", Истина);
	Если Вакансии = Неопределено Или Вакансии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПрежниеДанныеСостояния", 
		РегистрыСведений.СостоянияВакансий.ТекущееСостояниеВакансий(Вакансии));
	
	РегистрыСведений.СостоянияВакансий.СохранитьПрежнийНаборЗаписей(ЭтотОбъект, Замещение);
	
КонецПроцедуры

Процедура ИзменитьСостояниеСогласования(НаборЗаписей)
	
	Если Не ДополнительныеСвойства.Свойство("ПрежниеДанныеСостояния") Тогда
		Возврат;
	КонецЕсли;

	ПрежниеДанные = ДополнительныеСвойства["ПрежниеДанныеСостояния"];
	
	ВакансииМассив = Новый Массив;
	ВакансииМассив.Добавить(Отбор.Вакансия.Значение);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВакансииМассив, 
		ОбщегоНазначения.ВыгрузитьКолонку(ПрежниеДанные, "Ключ"), Истина);
	
	ТекущиеДанные = РегистрыСведений.СостоянияВакансий.ТекущееСостояниеВакансий(ВакансииМассив);
	
	// Если у каких-то вакансий состояние изменилось, появилось или исчезло, 
	// уточняем состояние согласования по текущему состоянию.
	
	ДанныеВакансий = Справочники.Вакансии.ДанныеВакансий(ВакансииМассив);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеВакансий, "Вакансия");
	
	Для Каждого Вакансия Из ВакансииМассив Цикл
		НайденныеСтроки = ДанныеВакансий.НайтиСтроки(Новый Структура("Вакансия", Вакансия));
		Если НайденныеСтроки.Количество() = 0 Или ЗначениеЗаполнено(НайденныеСтроки[0].Основание) Тогда
			// Вакансия создана на основании заявки, отдельно не согласовывается.
			Продолжить;
		КонецЕсли;
		ПрежнееСостояние = СвойствоСтруктуры(ПрежниеДанные.Получить(Вакансия), "Состояние");
		ТекущееСостояние = СвойствоСтруктуры(ТекущиеДанные.Получить(Вакансия), "Состояние");
		СостояниеСогласования = СвойствоСтруктуры(СогласованиеВакансий.ДанныеСогласования(Вакансия), "СостояниеСогласования");
		Если Перечисления.СостоянияСогласования.РешениеПринято(СостояниеСогласования) Тогда
			// Решение принято, не трогаем эту вакансию.
			Продолжить;
		КонецЕсли;
		Если ПрежнееСостояние = ТекущееСостояние Тогда
			// Состояние не изменилось.
			Продолжить;
		КонецЕсли;
		Если ПрежнееСостояние = Перечисления.СостоянияВакансии.Открыта 
			И ТекущееСостояние <> Перечисления.СостоянияВакансии.Открыта Тогда
			// Отзываем с согласования.
			Если СостояниеСогласования <> Перечисления.СостоянияСогласования.ПустаяСсылка() Тогда
				СогласованиеВакансий.УстановитьСостояниеСогласования(
					Вакансия, Перечисления.СостоянияСогласования.ПустаяСсылка());
			КонецЕсли;
		КонецЕсли;
		Если ПрежнееСостояние <> Перечисления.СостоянияВакансии.Открыта 
			И ТекущееСостояние = Перечисления.СостоянияВакансии.Открыта Тогда
			// Направляем на согласование.
			Если СостояниеСогласования <> Перечисления.СостоянияСогласования.Рассматривается Тогда
				СогласованиеВакансий.УстановитьСостояниеСогласования(
					Вакансия, Перечисления.СостоянияСогласования.Рассматривается);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СвойствоСтруктуры(Структура, Ключ)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ);
КонецФункции

Процедура УстановитьДатыПоСостояниям(Замещение)
	Если Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	Если РегистрыБЗК.ЭтоЗамещениеНабораЗаписей(Замещение) Тогда
		// В остальных режимах замещения используются все отборы.
		Если Не Отбор.Вакансия.Использование Тогда
			Текст = НСтр("ru = 'В наборе состояний вакансии не установлен отбор по вакансии.'");
			ОбщегоНазначенияКлиентСервер.Проверить(Ложь, Текст);
		КонецЕсли;
		Если Отбор.Период.Использование Тогда
			Текст = НСтр("ru = 'В наборе состояний вакансии избыточно установлен отбор по периоду.'");
			ОбщегоНазначенияКлиентСервер.Проверить(Ложь, Текст);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаСостояния Из ЭтотОбъект Цикл
		СтрокаСостояния.Период = ПодборПерсоналаКлиентСервер.ДатаВремяПоСостоянию(
			СтрокаСостояния.Период, СтрокаСостояния.Состояние);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
